cases/cylinder_vortex_vibration/fluid-openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
//z=0
//inner circle
   (5 0 0) //0
   (3.535533906 3.535533906 0) //1
   (0 5 0) //2
   (-3.535533906 3.535533906 0) //3
   (-5 0 0) //4
   (-3.535533906 -3.535533906 0) //5
   (0 -5 0) //6
   (3.535533906 -3.535533906 0) //7

//outer circle
   (30 0 0) //8
   (21.21320344 21.21320344 0) //9
   (0 30 0) //10
   (-21.21320344 21.21320344 0) //11
   (-30 0 0) //12
   (-21.21320344 -21.21320344 0) //13
   (0 -30 0) //14
   (21.21320344 -21.21320344 0) //15

//rectangle
   (400 0 0) //16
   (400 21.21320344 0) //17
   (400 200 0) //18
   (21.21320344 200 0) //19
   (0 200 0) //20
   (-21.21320344 200 0) //21
   (-200 200 0) //22
   (-200 21.21320344 0) //23
   (-200 0 0) //24
   (-200 -21.21320344 0) //25
   (-200 -200 0) //26
   (-21.21320344 -200 0) //27
   (0 -200 0) //28
   (21.21320344 -200 0) //29
   (400 -200 0) //30
   (400 -21.21320344 0) //31


//z=1
//inner circle
   (5 0 1) //32
   (3.535533906 3.535533906 1) //33
   (0 5 1) //34
   (-3.535533906 3.535533906 1) //35
   (-5 0 1) //36
   (-3.535533906 -3.535533906 1) //37
   (0 -5 1) //38
   (3.535533906 -3.535533906 1) //39

//outer circle
   (30 0 1) //40
   (21.21320344 21.21320344 1) //41
   (0 30 1) //42
   (-21.21320344 21.21320344 1) //43
   (-30 0 1) //44
   (-21.21320344 -21.21320344 1) //45
   (0 -30 1) //46
   (21.21320344 -21.21320344 1) //47

//rectangle
   (400 0 1) //48
   (400 21.21320344 1) //49
   (400 200 1) //50
   (21.21320344 200 1) //51
   (0 200 1) //52
   (-21.21320344 200 1) //53
   (-200 200 1) //54
   (-200 21.21320344 1) //55
   (-200 0 1) //56
   (-200 -21.21320344 1) //57
   (-200 -200 1) //58
   (-21.21320344 -200 1) //59
   (0 -200 1) //60
   (21.21320344 -200 1) //61
   (400 -200 1) //62
   (400 -21.21320344 1) //63
);

blocks
(
    hex (1 0 8 9 33 32 40 41) (15 51 1) simpleGrading (1 8 1) //Block 0
    hex (2 1 9 10 34 33 41 42) (15 51 1) simpleGrading (1 8 1) //Block 1
    hex (3 2 10 11 35 34 42 43) (15 51 1) simpleGrading (1 8 1) //Block 2
    hex (4 3 11 12 36 35 43 44) (15 51 1) simpleGrading (1 8 1) //Block 3
    hex (5 4 12 13 37 36 44 45) (15 51 1) simpleGrading (1 8 1) //Block 4
    hex (6 5 13 14 38 37 45 46) (15 51 1) simpleGrading (1 8 1) //Block 5
    hex (7 6 14 15 39 38 46 47) (15 51 1) simpleGrading (1 8 1) //Block 6
    hex (0 7 15 8 32 39 47 40) (15 51 1) simpleGrading (1 8 1) //Block 7
    hex (8 16 17 9 40 48 49 41) (32 15 1) simpleGrading (50 1 1) //Block 8
    hex (9 17 18 19 41 49 50 51) (32 28 1) simpleGrading (50 20 1) //Block 9
    hex (10 9 19 20 42 41 51 52) (15 28 1) simpleGrading (1 20 1) //Block 10
    hex (11 10 20 21 43 42 52 53) (15 28 1) simpleGrading (1 20 1) //Block 11
    hex (23 11 21 22 55 43 53 54) (25 28 1) simpleGrading (.03 20 1) //Block 12
    hex (24 12 11 23 56 44 43 55) (25 15 1) simpleGrading (.03 1 1) //Block 13
    hex (25 13 12 24 57 45 44 56) (25 15 1) simpleGrading (.03 1 1) //Block 14
    hex (26 27 13 25 58 59 45 57) (25 28 1) simpleGrading (.03 0.05 1) //Block 15
    hex (27 28 14 13 59 60 46 45) (15 28 1) simpleGrading (1 0.05 1) //Block 16
    hex (28 29 15 14 60 61 47 46) (15 28 1) simpleGrading (1 0.05 1) //Block 17
    hex (29 30 31 15 61 62 63 47) (32 28 1) simpleGrading (50 0.05 1) //Block 18
    hex (15 31 16 8 47 63 48 40) (32 15 1) simpleGrading (50 1 1) //Block 19
);

edges
(
    //inner cylinder surface
    arc 0  1  (4 3 0) 
    arc 32 33 (4 3 1) 

    arc 1  2  (3 4 0) 
    arc 33 34 (3 4 1) 

    arc 2  3  (-3 4 0) 
    arc 34 35 (-3 4 1) 

    arc 3  4  (-4 3 0) 
    arc 35 36 (-4 3 1)

    arc 4 5 (-4 -3 0)
    arc 36 37 (-4 -3 1)

    arc 5 6 (-3 -4 0)
    arc 37 38 (-3 -4 1)

    arc 6 7  (3 -4 0) 
    arc 38 39 (3 -4 1) 

    arc 7 0  (4 -3 0) 
    arc 39 32 (4 -3 1)

    //outer cylinder surface
    arc 8  9  (24 18 0) 
    arc 40 41 (24 18 1) 

    arc 9 10  (18 24 0) 
    arc 41 42 (18 24 1) 

    arc 10 11  (-18 24 0) 
    arc 42 43 (-18 24 1) 

    arc 11 12  (-24 18 0) 
    arc 43 44 (-24 18 1)

    arc 12 13 (-24 -18 0)
    arc 44 45 (-24 -18 1)

    arc 13 14 (-18 -24 0)
    arc 45 46 (-18 -24 1)

    arc 14 15  (18 -24 0) 
    arc 46 47 (18 -24 1) 

    arc 15 8  (24 -18 0) 
    arc 47 40 (24 -18 1)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
          (22 23 55 54)
          (23 24 56 55)
          (24 25 57 56)
          (25 26 58 57)
        );
    }

    outlet
    {
        type patch;
        faces
        (
          (30 31 63 62)
          (31 16 48 63)
          (16 17 49 48)
          (17 18 50 49)
        );
    }
   
    topAndBottom
    {
        type patch;
        faces
        (
          (18 19 51 50)
          (19 20 52 51)
          (20 21 53 52)
          (21 22 54 53)

          (26 27 59 58)
          (27 28 60 59)
          (28 29 61 60)
          (29 30 62 61)
        ); 
    }
    

    cylinder
    {
        type wall;
        faces
        (
          (1 0 32 33)
          (2 1 33 34)
          (3 2 34 35)
          (4 3 35 36)
          (5 4 36 37)
          (6 5 37 38)
          (7 6 38 39)
          (0 7 39 32)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
//circular faces
          (0 1 9 8)
          (32 40 41 33)

          (1 2 10 9)
          (33 41 42 34)

          (2 3 11 10)
          (34 42 43 35)

          (3 4 12 11)
          (35 43 44 36)

          (4 5 13 12)
          (36 44 45 37)

          (5 6 14 13)
          (37 45 46 38)

          (6 7 15 14)
          (38 46 47 39)

          (7 0 8 15)
          (39 47 40 32)

//rectangular faces
          (8 9 17 16)
          (40 48 49 41)

          (9 19 18 17)
          (41 49 50 51)

          (9 10 20 19)
          (41 51 52 42)

          (10 11 21 20)
          (42 52 53 43)

          (11 23 22 21)
          (43 53 54 55)

          (11 12 24 23)
          (43 55 56 44)

          (12 13 25 24)
          (44 56 57 45)

          (13 27 26 25)
          (45 57 58 59)

          (13 14 28 27)
          (45 59 60 46)

          (14 15 29 28)
          (46 60 61 47)

          (15 31 30 29)
          (47 61 62 63)

          (15 8 16 31)
          (47 63 48 40)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
