cases/cylinder_vortex_vibration/fluid-openfoam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



motionSolverLibs ("libfvMotionSolvers.so");

dynamicFvMesh dynamicMotionSolverFvMesh;

solver      displacementLaplacian;
// OpenFOAM9 or newer: rename "solver" to "motionSolver"

displacementLaplacianCoeffs 
{
    diffusivity inverseDistance 1(cylinder);
}

// ************************************************************************* //
