cases/cylinder_vortex_vibration/fluid-openfoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.068018 0 0);


boundaryField
{
    topAndBottom
    {
	type            slip;
    }

    inlet
    {
	type            fixedValue;
	value		$internalField;
    }

    outlet
    {
	type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }


    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
     }

}

// ************************************************************************* //
