cases/cylinder_vortex_vibration/fluid-openfoam/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topAndBottom
    {
        type            fixedValue;
        value    $internalField;
    }

    inlet
    {
        type            fixedValue;
        value $internalField;
    }

    outlet
    {
        type            fixedValue;
        value $internalField;
    }

    cylinder
    {
        type            fixedValue;
        value           $internalField;
 }

    frontAndBack
    {
        type            empty;
    }
}

