cases/cylinder_vortex_vibration/fluid-openfoam/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forcesIncompressible.cfg"
log           yes;
rho         rhoInf;     // Indicates incompressible 
rhoInf      1000;    // Redundant for incompressible
patches     (cylinder);
CofR        (0 0 0);
pitchAxis   (0 0 1);

// ************************************************************************* //
