cases/cylinder_vortex_vibration/fluid-openfoam/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //