cases/cylinder_vortex_vibration/fluid-openfoam/system/preciceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Mesh-Fluid;
    locations         faceCenters;
    patches           (cylinder);
    
    readData
    (
      Displacement-Cylinder
    );
    
    writeData
    (
      Force
    );
  }; 
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1000;
  nu  nu [ 0 2 -1 0 0 0 0 ] 1.0e-06;
}

// ************************************************************************* //
